packages/server/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 10
  defaults:
    headers:
      Accept-Encoding: identity
scenarios:
  - flow:
      - get:
          url: "/api/v1/campsites"
          capture:
            - json: "$.id"
              as: "campsiteId"
      - get:
          url: "/api/v1/campsites/{{ campsiteId }}"